000100 identification division.
000200 program-id. MainKernelInCobol.

000500 procedure division.
000600     DISPLAY "Hello world".
000700     stop run.
